AUTO_config_TK_pesok/src/InformationRegisters/ТК_РазделениеНоменклатурыПоОрганизациям/ТК_РазделениеНоменклатурыПоОрганизациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_РазделениеНоменклатурыПоОрганизациям</name>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование2</name>
    <comment>Локализованное наименование 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>Базовая единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <comment>Основная единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияУпаковки</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЯщиков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <comment>Тип номенклатуры</comment>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <comment>Вид номенклатуры</comment>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяМарка</name>
    <type>
      <types>CatalogRef.ТоварныеМарки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>Страна происхождения по умолчанию</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияТовара</name>
    <comment>Срок хранения товара (в днях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЦенообразования</name>
    <comment>Группа ценообразования</comment>
    <type>
      <types>CatalogRef.ГруппыЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУКТВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцизГруппа</name>
    <comment>Группа акциза</comment>
    <type>
      <types>CatalogRef.ГруппыАкциза</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляБухгалтерии</name>
    <comment>Группа для бухгалтерии</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПланирования</name>
    <type>
      <types>CatalogRef.ТипНоменклатурыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойАртикул</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИндикатива</name>
    <type>
      <types>CatalogRef.ТК_ТипыИндикатива</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеRB</name>
    <comment>Наименование  для Radio Beacon</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.ТК_Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Товара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <comment>Состав набора</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаЦены</name>
      <comment>Способ расчета цены реализации</comment>
      <type>
        <types>EnumRef.СпособыРасчетаЦены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_РазделениеНоменклатурыПоОрганизациям/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем


#КонецОбласти


Функция ПолучитьОрганизациюСпискаНоменклатуры(ОрганизацияПоУмолчанию, СписокНоменклатуры,ТорговаяПлощадка = Неопределено)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат	= Новый Соответствие;
	Если СписокНоменклатуры.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	
	Для Каждого Номенклатура Из СписокНоменклатуры Цикл
		Если Номенклатура = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтруктураВозврата = Новый Структура();
		СтруктураВозврата.Вставить("Организация",ОрганизацияПоУмолчанию);
		СтруктураВозврата.Вставить("Номенклатура",Неопределено);
		СтруктураВозврата.Вставить("ТорговаяПлощадка",Неопределено);
		

		Результат.Вставить(Номенклатура, СтруктураВозврата);
	КонецЦикла;
	
	МассивТорговаяПлощадка = Новый Массив();
	МассивТорговаяПлощадка.Добавить(Справочники.ТорговыеПлощадки.ПустаяСсылка());

	Если ЗначениеЗаполнено(ТорговаяПлощадка) Тогда
		МассивТорговаяПлощадка.Добавить(ТорговаяПлощадка);
	КонецЕсли;
		
	СоответствиеЭлементовИГрупп = ОбщегоНазначенияТКВызовСервера.ПолучитьСписокВышеСтоящихГруппЭлементов(СписокНоменклатуры);
	
	ТаблицаИерархии = Новый ТаблицаЗначений;
	ТаблицаИерархии.Колонки.Добавить("Элемент",		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаИерархии.Колонки.Добавить("Родитель",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаИерархии.Колонки.Добавить("Уровень",		ОбщегоНазначенияТК.ПолучитьОписаниеТиповЧисла(10, 0));
	
	Для каждого Номенклатура Из СписокНоменклатуры Цикл
		
		НоваяСтрока = ТаблицаИерархии.Добавить();
		НоваяСтрока.Элемент		= Номенклатура;
		НоваяСтрока.Родитель	= Номенклатура;
		
		СписокГрупп = СоответствиеЭлементовИГрупп.Получить(Номенклатура);
		Если СписокГрупп = Неопределено Тогда
			НоваяСтрока.Уровень = 1;
			Продолжить;
		КонецЕсли;
		
		КоличествоВышеСтоящихГрупп = СписокГрупп.Количество();
		
		НоваяСтрока.Уровень = КоличествоВышеСтоящихГрупп + 1;
		
		Для Индекс = 1 По КоличествоВышеСтоящихГрупп Цикл
			НоваяСтрока = ТаблицаИерархии.Добавить();
			НоваяСтрока.Элемент	= Номенклатура;
			НоваяСтрока.Родитель= СписокГрупп[Индекс - 1];
			НоваяСтрока.Уровень	= КоличествоВышеСтоящихГрупп - Индекс + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	НоваяСтрока = ТаблицаИерархии.Добавить();	// Корень
	
	МассивНоменклатуры = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаИерархии, "Родитель", Истина);

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТаблицаИерархии",	ТаблицаИерархии);
	Запрос.УстановитьПараметр("МассивНоменклатуры",	ОбщегоНазначенияТКВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивНоменклатуры));
	Запрос.УстановитьПараметр("МассивТорговаяПлощадка",	МассивТорговаяПлощадка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИерархии.Элемент КАК Элемент,
	|	ТаблицаИерархии.Родитель КАК Родитель,
	|	ТаблицаИерархии.Уровень КАК Уровень
	|ПОМЕСТИТЬ ВТТаблицаИерархии
	|ИЗ
	|	&ТаблицаИерархии КАК ТаблицаИерархии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Родитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИерархии.Элемент КАК Номенклатура,
	|	ТаблицаИерархии.Родитель КАК Родитель,
	|	ТаблицаИерархии.Уровень КАК Уровень,
	|	ТК_РазделениеНоменклатурыПоОрганизациям.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ТК_РазделениеНоменклатурыПоОрганизациям.Номенклатура КАК НоменклатураОрганизация,
	|	ТК_РазделениеНоменклатурыПоОрганизациям.Организация КАК Организация
	|ИЗ
	|	ВТТаблицаИерархии КАК ТаблицаИерархии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТК_РазделениеНоменклатурыПоОрганизациям КАК ТК_РазделениеНоменклатурыПоОрганизациям
	|		ПО ТаблицаИерархии.Родитель = ТК_РазделениеНоменклатурыПоОрганизациям.Номенклатура
	|ГДЕ
	|	ТК_РазделениеНоменклатурыПоОрганизациям.Номенклатура В(&МассивНоменклатуры)
	|	И ТК_РазделениеНоменклатурыПоОрганизациям.ТорговаяПлощадка В(&МассивТорговаяПлощадка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень УБЫВ,
	|	ТорговаяПлощадка УБЫВ";

	ТаблицаОрганизации = Запрос.Выполнить().Выгрузить();
	ТаблицаОрганизации.Индексы.Добавить("Номенклатура");
	
	ОтборНоменклатура = Новый Структура("Номенклатура");
	
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();

	Для Каждого Номенклатура Из СписокНоменклатуры Цикл
		СтруктураВозврата = Результат.Получить(Номенклатура);

		 ОтборНоменклатура.Номенклатура = Номенклатура;
		 
		 НайденныеСтроки = ТаблицаОрганизации.НайтиСтроки(ОтборНоменклатура);
		 Если НайденныеСтроки.Количество() > 0 Тогда
			 нСтока = НайденныеСтроки[0];
			 Если ЗначениеЗаполнено(нСтока.Организация)Тогда
				СтруктураВозврата.Организация = нСтока.Организация;  
			 КонецЕсли;
					 
			 ЗаполнитьЗначенияСвойств(СтруктураВозврата, НайденныеСтроки[0],,"Организация");
			 СтруктураВозврата.Номенклатура = нСтока.НоменклатураОрганизация;
		 Иначе
			 
			 ОтборНоменклатура.Номенклатура = ПустаяНоменклатура;
			 
			 НайденныеСтроки = ТаблицаОрганизации.НайтиСтроки(ОтборНоменклатура);
			 Если НайденныеСтроки.Количество() > 0 Тогда
				 
				 нСтока = НайденныеСтроки[0];
				 Если ЗначениеЗаполнено(нСтока.Организация)Тогда
					 СтруктураВозврата.Организация = нСтока.Организация;  
				 КонецЕсли;
								 
				 ЗаполнитьЗначенияСвойств(СтруктураВозврата, нСтока,,"Организация");

				 СтруктураВозврата.Номенклатура = нСтока.НоменклатураОрганизация;
			 КонецЕсли;
			 
		 КонецЕсли;

	КонецЦикла;
	
	Возврат Результат;

	
КонецФункции

#КонецОбласти



#КонецЕсли
